{
    "pageTitle": "Subclick Sequencer",
    "content": [
        {
            "type": "subheader",
            "text": "Introduction"
        },
        {
            "type": "text",
            "content": "This UI element describes the individual clicks that this synthesizer generates as a series of extremely short \"subclicks\" that, when played together, sound to the listener like one single click. "
        },
        {
            "type": "subheader",
            "text": "Controls"
        },
        {
            "type": "text",
            "content": "Subclick bars: Each subclick is represented by a single bar in the series. \nMode Selectors: Each subclick has a Frequency, Length, Overlap, and Level value. You can choose which value you are currently editing by clicking on the appropriate tab. Attributes:\n\t- Frequency: what pitch the subclick vibrates at. in Hz and kHz.\n\t- Length: how long the subclick lasts.  in microseconds and miliseconds.\n\t- Overlap: how soon after this subclick begins that the next one does. us and ms again.\n\t- Level: the relative intensity of the subclick.\nModifying a Subclick: Select the subclick by clicking on it, and then drag it up or down to change the value of the current attribute. Double click to enter an exact value.\nAdding a Subclick: Click the plus button at the end of the series to add one. \nRemoving a Subclick: Click on a bar to select it and press delete or backspace. \nPreview: Plays a single example click. "
        },
        {
            "type": "subheader",
            "text": "Tips"
        },
        {
            "type": "text",
            "content": "- You might find it easier to first describe the full song in the frequency editor, and then add, modify, or remove subclicks once you have a full song to work with. \n- If you have a lot of subclicks, you might have to scroll to see the plus button again.\n- setting an overlap for subclicks at the end doesn't do anything\n- clicking in the preview often goes away when you play the full song."
        },
        {
            "type": "subheader",
            "text": "Explanation"
        },
        {
            "type": "text",
            "content": "The approach of treating each click as a series of subclicks is meant to mimic the various methods of insect sound reproduction. Most biological methods involve quickly scraping a series or chitinous ridges, or buckling a series of flexibile ribs. In both cases, each ridge or rib has a sound associated with it. A single scrape along the ridge produces a single click, made up of several subclicks played very close together. This scraping or buckling is repeated at great speed, producing continuous notes. \n\nThis synthesizer was made as a demonstration that the subclick -> click -> continuous note model can be used to accurately simulate two different types of rhythmic bug sound production: stridulation, and tymbaling. "
        }
    ]
}